dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_OFF (16u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_OFF (17u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_OFF (18u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_OFF (19u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_OFF (20u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_OFF (21u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_OFF (22u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_OFF (23u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_OFF (24u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_OFF (25u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_OFF (26u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_OFF (27u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_OFF (28u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_OFF (29u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_OFF (30u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_OFF (31u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_OFF (0u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_OFF (1u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_OFF (2u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_OFF (3u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_OFF (4u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_OFF (5u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_OFF (6u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_LEN (1u)

